MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX430F064H.PIC
      <edc:AdjustPoint edc:_addr="0x1F885400" edc:offset="3072"/>
      <edc:AdjustPoint edc:_addr="0x1F886000" edc:offset="256"/>
      <edc:SFRDef edc:_addr="0x1F886100" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ANSELB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1111111111111111" edc:name="ANSELB" edc:nzwidth="0x20" edc:por="----------------1111111111111111" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ANSB0" edc:desc="" edc:mask="0x1" edc:name="ANSB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB1" edc:desc="" edc:mask="0x1" edc:name="ANSB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB2" edc:desc="" edc:mask="0x1" edc:name="ANSB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB3" edc:desc="" edc:mask="0x1" edc:name="ANSB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB4" edc:desc="" edc:mask="0x1" edc:name="ANSB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB5" edc:desc="" edc:mask="0x1" edc:name="ANSB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB6" edc:desc="" edc:mask="0x1" edc:name="ANSB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB7" edc:desc="" edc:mask="0x1" edc:name="ANSB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB8" edc:desc="" edc:mask="0x1" edc:name="ANSB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB9" edc:desc="" edc:mask="0x1" edc:name="ANSB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB10" edc:desc="" edc:mask="0x1" edc:name="ANSB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB11" edc:desc="" edc:mask="0x1" edc:name="ANSB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB12" edc:desc="" edc:mask="0x1" edc:name="ANSB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB13" edc:desc="" edc:mask="0x1" edc:name="ANSB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB14" edc:desc="" edc:mask="0x1" edc:name="ANSB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB15" edc:desc="" edc:mask="0x1" edc:name="ANSB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886110" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TRISB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1111111111111111" edc:name="TRISB" edc:nzwidth="0x20" edc:por="----------------1111111111111111" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISB0" edc:desc="" edc:mask="0x1" edc:name="TRISB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB1" edc:desc="" edc:mask="0x1" edc:name="TRISB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB2" edc:desc="" edc:mask="0x1" edc:name="TRISB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB3" edc:desc="" edc:mask="0x1" edc:name="TRISB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB4" edc:desc="" edc:mask="0x1" edc:name="TRISB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB5" edc:desc="" edc:mask="0x1" edc:name="TRISB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB6" edc:desc="" edc:mask="0x1" edc:name="TRISB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB7" edc:desc="" edc:mask="0x1" edc:name="TRISB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB8" edc:desc="" edc:mask="0x1" edc:name="TRISB8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISB9" edc:desc="" edc:mask="0x1" edc:name="TRISB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB10" edc:desc="" edc:mask="0x1" edc:name="TRISB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB11" edc:desc="" edc:mask="0x1" edc:name="TRISB11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISB12" edc:desc="" edc:mask="0x1" edc:name="TRISB12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISB13" edc:desc="" edc:mask="0x1" edc:name="TRISB13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISB14" edc:desc="" edc:mask="0x1" edc:name="TRISB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB15" edc:desc="" edc:mask="0x1" edc:name="TRISB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886120" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PORTB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PORTB" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB2" edc:desc="" edc:mask="0x1" edc:name="RB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB3" edc:desc="" edc:mask="0x1" edc:name="RB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB4" edc:desc="" edc:mask="0x1" edc:name="RB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB5" edc:desc="" edc:mask="0x1" edc:name="RB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB6" edc:desc="" edc:mask="0x1" edc:name="RB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB7" edc:desc="" edc:mask="0x1" edc:name="RB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB8" edc:desc="" edc:mask="0x1" edc:name="RB8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RB9" edc:desc="" edc:mask="0x1" edc:name="RB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB10" edc:desc="" edc:mask="0x1" edc:name="RB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB11" edc:desc="" edc:mask="0x1" edc:name="RB11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RB12" edc:desc="" edc:mask="0x1" edc:name="RB12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RB13" edc:desc="" edc:mask="0x1" edc:name="RB13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RB14" edc:desc="" edc:mask="0x1" edc:name="RB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB15" edc:desc="" edc:mask="0x1" edc:name="RB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
