MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX430F064H.PIC
      <edc:SFRDef edc:_addr="0x1F886690" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="6" edc:access="----------------------nnnn------" edc:cname="CNSTATG" edc:desc="" edc:grp="PORTG" edc:impl="0xffff03c0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------xxxx------" edc:name="CNSTATG" edc:nzwidth="0x20" edc:por="----------------------xxxx------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG6" edc:desc="" edc:mask="0x1" edc:name="CNSTATG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG7" edc:desc="" edc:mask="0x1" edc:name="CNSTATG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG8" edc:desc="" edc:mask="0x1" edc:name="CNSTATG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG9" edc:desc="" edc:mask="0x1" edc:name="CNSTATG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f800000" edc:endaddr="0x1f80a400" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph0">
      <edc:SFRDef edc:_addr="0x1F800000" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-01385_wdt_pwrt_pb_v2.Module" edc:_refcount="1" edc:access="----------------n--------rrrrrnn" edc:cname="WDTCON" edc:desc="" edc:grp="WDT" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------x--------xxxxxxx" edc:name="WDTCON" edc:nzwidth="0x20" edc:por="----------------0--------00000x0" edc:portals="CLR SET INV" ltx:baseofperipheral="WDT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDTCLR" edc:desc="" edc:mask="0x1" edc:name="WDTCLR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTWINEN" edc:desc="" edc:mask="0x1" edc:name="WDTWINEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS" edc:desc="" edc:mask="0x1f" edc:name="SWDTPS" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SWDTPS0" edc:desc="" edc:mask="0x1" edc:name="SWDTPS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS1" edc:desc="" edc:mask="0x1" edc:name="SWDTPS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS2" edc:desc="" edc:mask="0x1" edc:name="SWDTPS2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS3" edc:desc="" edc:mask="0x1" edc:name="SWDTPS3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS4" edc:desc="" edc:mask="0x1" edc:name="SWDTPS4" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WDTPSTA" edc:desc="" edc:mask="0x1" edc:name="WDTPSTA" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WDTPS" edc:desc="" edc:mask="0x1" edc:name="WDTPS" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.3">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800010" edc:offset="496"/>
      <edc:SFRDef edc:_addr="0x1F800200" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-00748_tmr_rtcc_pb_v1.Module" edc:_refcount="1" edc:access="------nnnnnnnnnnnnn-----nn--nrrn" edc:cname="RTCCON" edc:desc="" edc:grp="RTCC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------xxxxxxxxxxxxx-----xx--xxxx" edc:name="RTCCON" edc:nzwidth="0x20" edc:por="------0000000000000-----00--0000" edc:portals="CLR SET INV" ltx:baseofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RTCOE" edc:desc="" edc:mask="0x1" edc:name="RTCOE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HALFSEC" edc:desc="" edc:mask="0x1" edc:name="HALFSEC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTCSYNC" edc:desc="" edc:mask="0x1" edc:name="RTCSYNC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTCWREN" edc:desc="" edc:mask="0x1" edc:name="RTCWREN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="RTCCLKON" edc:desc="" edc:mask="0x1" edc:name="RTCCLKON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTSECSEL" edc:desc="" edc:mask="0x1" edc:name="RTSECSEL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAL" edc:desc="" edc:mask="0x3ff" edc:name="CAL" edc:nzwidth="0xa"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="REAL TIME CLOCK" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800210" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-00748_tmr_rtcc_pb_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="RTCALRM" edc:desc="" edc:grp="RTCC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="RTCALRM" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ARPT" edc:desc="" edc:mask="0xff" edc:name="ARPT" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="AMASK" edc:desc="" edc:mask="0xf" edc:name="AMASK" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="ALRMSYNC" edc:desc="" edc:mask="0x1" edc:name="ALRMSYNC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PIV" edc:desc="" edc:mask="0x1" edc:name="PIV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHIME" edc:desc="" edc:mask="0x1" edc:name="CHIME" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALRMEN" edc:desc="" edc:mask="0x1" edc:name="ALRMEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800220" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-00748_tmr_rtcc_pb_v1.Module" edc:_refcount="1" edc:access="rrrnnnnnnnnnnnnnrnnnnnnn--------" edc:cname="RTCTIME" edc:desc="" edc:grp="RTCC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000xxxxxxxxxxxxx0xxxxxxx--------" edc:name="RTCTIME" edc:nzwidth="0x20" edc:por="000xxxxxxxxxxxxx0xxxxxxx--------" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="SEC01" edc:desc="" edc:mask="0xf" edc:name="SEC01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SEC10" edc:desc="" edc:mask="0xf" edc:name="SEC10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MIN01" edc:desc="" edc:mask="0xf" edc:name="MIN01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MIN10" edc:desc="" edc:mask="0xf" edc:name="MIN10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="HR01" edc:desc="" edc:mask="0xf" edc:name="HR01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="HR10" edc:desc="" edc:mask="0xf" edc:name="HR10" edc:nzwidth="0x4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800230" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-00748_tmr_rtcc_pb_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnrrrnnnnnrrnnnnnn----rnnn" edc:cname="RTCDATE" edc:desc="" edc:grp="RTCC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx000xxxxx00xxxxxx----0xxx" edc:name="RTCDATE" edc:nzwidth="0x20" edc:por="xxxxxxxx000xxxxx00xxxxxx----0xxx" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDAY01" edc:desc="" edc:mask="0xf" edc:name="WDAY01" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DAY01" edc:desc="" edc:mask="0xf" edc:name="DAY01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DAY10" edc:desc="" edc:mask="0xf" edc:name="DAY10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MONTH01" edc:desc="" edc:mask="0xf" edc:name="MONTH01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MONTH10" edc:desc="" edc:mask="0xf" edc:name="MONTH10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="YEAR01" edc:desc="" edc:mask="0xf" edc:name="YEAR01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="YEAR10" edc:desc="" edc:mask="0xf" edc:name="YEAR10" edc:nzwidth="0x4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800240" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-00748_tmr_rtcc_pb_v1.Module" edc:_refcount="1" edc:access="rrrnnnnnrnnnnnnnrnnnnnnn--------" edc:cname="ALRMTIME" edc:desc="" edc:grp="RTCC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000xxxxx0xxxxxxx0xxxxxxx--------" edc:name="ALRMTIME" edc:nzwidth="0x20" edc:por="000xxxxx0xxxxxxx0xxxxxxx--------" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="SEC01" edc:desc="" edc:mask="0xf" edc:name="SEC01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SEC10" edc:desc="" edc:mask="0xf" edc:name="SEC10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MIN01" edc:desc="" edc:mask="0xf" edc:name="MIN01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MIN10" edc:desc="" edc:mask="0xf" edc:name="MIN10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="HR01" edc:desc="" edc:mask="0xf" edc:name="HR01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="HR10" edc:desc="" edc:mask="0xf" edc:name="HR10" edc:nzwidth="0x4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800250" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-00748_tmr_rtcc_pb_v1.Module" edc:_refcount="1" edc:access="--------rrrnnnnnrrnnnnnn----rnnn" edc:cname="ALRMDATE" edc:desc="" edc:grp="RTCC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000xxxxx00xxxxxx----0xxx" edc:name="ALRMDATE" edc:nzwidth="0x20" edc:por="--------000xxxxx00xxxxxx----0xxx" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDAY01" edc:desc="" edc:mask="0xf" edc:name="WDAY01" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DAY01" edc:desc="" edc:mask="0xf" edc:name="DAY01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DAY10" edc:desc="" edc:mask="0xf" edc:name="DAY10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MONTH01" edc:desc="" edc:mask="0xf" edc:name="MONTH01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MONTH10" edc:desc="" edc:mask="0xf" edc:name="MONTH10" edc:nzwidth="0x4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800260" edc:offset="928"/>
      <edc:SFRDef edc:_addr="0x1F800600" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00687_tmr_classa_pb_v1.Module" edc:_refcount="1" edc:access="----------------n-nnr---n-nn-nn-" edc:cname="T1CON" edc:desc="" edc:grp="TMR1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00000---0-00-00-" edc:name="T1CON" edc:nzwidth="0x20" edc:por="----------------00000---0-00-00-" edc:portals="CLR SET INV" ltx:baseofperipheral="TMR1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TCS" edc:desc="" edc:mask="0x1" edc:name="TCS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSYNC" edc:desc="" edc:mask="0x1" edc:name="TSYNC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TCKPS" edc:desc="" edc:mask="0x3" edc:name="TCKPS" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TGATE" edc:desc="" edc:mask="0x1" edc:name="TGATE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="TWIP" edc:desc="" edc:mask="0x1" edc:name="TWIP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TWDIS" edc:desc="" edc:mask="0x1" edc:name="TWDIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TCKPS0" edc:desc="" edc:mask="0x1" edc:name="TCKPS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCKPS1" edc:desc="" edc:mask="0x1" edc:name="TCKPS1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="TSIDL" edc:desc="" edc:mask="0x1" edc:name="TSIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TON" edc:desc="" edc:mask="0x1" edc:name="TON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        <edc:FreezeBit edc:freezeval="1" edc:name="TIMER1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800610" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00687_tmr_classa_pb_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TMR1" edc:desc="" edc:grp="TMR1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="TMR1" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="TMR1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TMR1" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="TMR1" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800620" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00687_tmr_classa_pb_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PR1" edc:desc="" edc:grp="TMR1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000001111111111111111" edc:name="PR1" edc:nzwidth="0x20" edc:por="00000000000000001111111111111111" edc:portals="CLR SET INV" ltx:memberofperipheral="TMR1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PR1" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="PR1" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
