MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX430F064H.PIC
      <edc:SFRDef edc:_addr="0x1F80FCA4" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="34" edc:access="----------------------------nnnn" edc:cname="RPG9R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPG9R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPG9R" edc:desc="" edc:mask="0xf" edc:name="RPG9R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
  </edc:PhysicalSpace>
  <edc:PinList edc:ppsflavor="complex-grouped">
    <edc:Pin>
      <!--Pin 1-->
      <edc:VirtualPin edc:name="RE5"/>
      <edc:VirtualPin edc:name="PMD5"/>
      <edc:VirtualPin edc:name="RPE5" edc:ppsgroup="2" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="AN22"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="RE6"/>
      <edc:VirtualPin edc:name="PMD6"/>
      <edc:VirtualPin edc:name="AN23"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="RE7"/>
      <edc:VirtualPin edc:name="PMD7"/>
      <edc:VirtualPin edc:name="AN27"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="RG6"/>
      <edc:VirtualPin edc:name="PMA5"/>
      <edc:VirtualPin edc:name="SCK2"/>
      <edc:VirtualPin edc:name="RPG6" edc:ppsgroup="3" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="C1IND"/>
      <edc:VirtualPin edc:name="AN16"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="RG7"/>
      <edc:VirtualPin edc:name="PMA4"/>
      <edc:VirtualPin edc:name="RPG7" edc:ppsgroup="2" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="C1INC"/>
      <edc:VirtualPin edc:name="AN17"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="RG8"/>
      <edc:VirtualPin edc:name="PMA3"/>
      <edc:VirtualPin edc:name="RPG8" edc:ppsgroup="1" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="C2IND"/>
      <edc:VirtualPin edc:name="AN18"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="RG9"/>
      <edc:VirtualPin edc:name="PMA2"/>
      <edc:VirtualPin edc:name="RPG9" edc:ppsgroup="4" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="C2INC"/>
      <edc:VirtualPin edc:name="AN19"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 9-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 10-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 11-->
      <edc:VirtualPin edc:name="RB5"/>
      <edc:VirtualPin edc:name="VBUSON"/>
      <edc:VirtualPin edc:name="RPB5" edc:ppsgroup="1" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="C1INA"/>
      <edc:VirtualPin edc:name="AN5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 12-->
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="C1INB"/>
      <edc:VirtualPin edc:name="AN4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 13-->
      <edc:VirtualPin edc:name="RB3"/>
      <edc:VirtualPin edc:name="RPB3" edc:ppsgroup="2" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="C2INA"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="PGED3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 14-->
      <edc:VirtualPin edc:name="RB2"/>
      <edc:VirtualPin edc:name="CTED13"/>
      <edc:VirtualPin edc:name="RPB2" edc:ppsgroup="3" edc:ppsval="15"/>
      <edc:VirtualPin edc:name="C2INB"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="PGEC3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 15-->
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="CTED12"/>
      <edc:VirtualPin edc:name="RPB1" edc:ppsgroup="2" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="VREF-"/>
      <edc:VirtualPin edc:name="PGEC1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 16-->
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="PMA6"/>
      <edc:VirtualPin edc:name="RPB0" edc:ppsgroup="3" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="VREF+"/>
      <edc:VirtualPin edc:name="PGED1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 17-->
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="RPB6" edc:ppsgroup="4" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="PGEC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 18-->
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="CTED3"/>
      <edc:VirtualPin edc:name="RPB7" edc:ppsgroup="3" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="PGED2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 19-->
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 20-->
      <edc:VirtualPin edc:name="AVSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 21-->
      <edc:VirtualPin edc:name="RB8"/>
      <edc:VirtualPin edc:name="CTED10"/>
      <edc:VirtualPin edc:name="RPB8" edc:ppsgroup="3" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="AN8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 22-->
      <edc:VirtualPin edc:name="RB9"/>
      <edc:VirtualPin edc:name="PMA7"/>
      <edc:VirtualPin edc:name="CTED4"/>
      <edc:VirtualPin edc:name="RPB9" edc:ppsgroup="1" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="AN9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 23-->
      <edc:VirtualPin edc:name="RB10"/>
      <edc:VirtualPin edc:name="PMA13"/>
      <edc:VirtualPin edc:name="CTED11"/>
      <edc:VirtualPin edc:name="RPB10" edc:ppsgroup="1" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="CVREFOUT"/>
      <edc:VirtualPin edc:name="TMS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 24-->
      <edc:VirtualPin edc:name="RB11"/>
      <edc:VirtualPin edc:name="PMA12"/>
      <edc:VirtualPin edc:name="AN11"/>
      <edc:VirtualPin edc:name="TDO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 25-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 26-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 27-->
      <edc:VirtualPin edc:name="RB12"/>
      <edc:VirtualPin edc:name="PMA11"/>
      <edc:VirtualPin edc:name="AN12"/>
      <edc:VirtualPin edc:name="TCK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 28-->
      <edc:VirtualPin edc:name="RB13"/>
      <edc:VirtualPin edc:name="PMA10"/>
      <edc:VirtualPin edc:name="AN13"/>
      <edc:VirtualPin edc:name="TDI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 29-->
      <edc:VirtualPin edc:name="RB14"/>
      <edc:VirtualPin edc:name="PMA1"/>
      <edc:VirtualPin edc:name="CTED5"/>
      <edc:VirtualPin edc:name="RPB14" edc:ppsgroup="4" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="AN14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 30-->
      <edc:VirtualPin edc:name="RB15"/>
      <edc:VirtualPin edc:name="PMA0"/>
      <edc:VirtualPin edc:name="CTED6"/>
      <edc:VirtualPin edc:name="OCFB"/>
      <edc:VirtualPin edc:name="RPB15" edc:ppsgroup="3" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="AN15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 31-->
      <edc:VirtualPin edc:name="RF4"/>
      <edc:VirtualPin edc:name="PMA9"/>
      <edc:VirtualPin edc:name="SDA2"/>
      <edc:VirtualPin edc:name="RPF4" edc:ppsgroup="1" edc:ppsval="2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 32-->
      <edc:VirtualPin edc:name="RF5"/>
      <edc:VirtualPin edc:name="PMA8"/>
      <edc:VirtualPin edc:name="SCL2"/>
      <edc:VirtualPin edc:name="RPF5" edc:ppsgroup="2" edc:ppsval="2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 33-->
      <edc:VirtualPin edc:name="RF3"/>
      <edc:VirtualPin edc:name="RPF3" edc:ppsgroup="4" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="USBID"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 34-->
      <edc:VirtualPin edc:name="VBUS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 35-->
      <edc:VirtualPin edc:name="VUSB3V3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 36-->
      <edc:VirtualPin edc:name="D-"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 37-->
      <edc:VirtualPin edc:name="D+"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 38-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 39-->
      <edc:VirtualPin edc:name="RC12"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="OSC1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 40-->
      <edc:VirtualPin edc:name="RC15"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="OSC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 41-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 42-->
      <edc:VirtualPin edc:name="RD8"/>
      <edc:VirtualPin edc:name="RTCC"/>
      <edc:VirtualPin edc:name="RPD8" edc:ppsgroup="4" edc:ppsval="4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 43-->
      <edc:VirtualPin edc:name="RD9"/>
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="RPD9" edc:ppsgroup="3" edc:ppsval="0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 44-->
      <edc:VirtualPin edc:name="RD10"/>
      <edc:VirtualPin edc:name="PMCS2"/>
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="RPD10" edc:ppsgroup="1" edc:ppsval="3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 45-->
      <edc:VirtualPin edc:name="RD11"/>
      <edc:VirtualPin edc:name="PMCS1"/>
      <edc:VirtualPin edc:name="RPD11" edc:ppsgroup="2" edc:ppsval="3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 46-->
      <edc:VirtualPin edc:name="RD0"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="RPD0" edc:ppsgroup="4" edc:ppsval="3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 47-->
      <edc:VirtualPin edc:name="RC13"/>
      <edc:VirtualPin edc:name="RPC13" edc:ppsgroup="2" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="SOSCI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 48-->
      <edc:VirtualPin edc:name="RC14"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="RPC14" edc:ppsgroup="1" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="SOSCO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 49-->
      <edc:VirtualPin edc:name="RD1"/>
      <edc:VirtualPin edc:name="RPD1" edc:ppsgroup="4" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="AN24"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 50-->
      <edc:VirtualPin edc:name="RD2"/>
      <edc:VirtualPin edc:name="SCK1"/>
      <edc:VirtualPin edc:name="RPD2" edc:ppsgroup="1" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="AN25"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 51-->
      <edc:VirtualPin edc:name="RD3"/>
      <edc:VirtualPin edc:name="RPD3" edc:ppsgroup="2" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="AN26"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 52-->
      <edc:VirtualPin edc:name="RD4"/>
      <edc:VirtualPin edc:name="PMWR"/>
      <edc:VirtualPin edc:name="RPD4" edc:ppsgroup="3" edc:ppsval="4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 53-->
      <edc:VirtualPin edc:name="RD5"/>
      <edc:VirtualPin edc:name="PMRD"/>
      <edc:VirtualPin edc:name="RPD5" edc:ppsgroup="4" edc:ppsval="6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 54-->
      <edc:VirtualPin edc:name="RD6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 55-->
      <edc:VirtualPin edc:name="RD7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 56-->
      <edc:VirtualPin edc:name="VCAP"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 57-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 58-->
      <edc:VirtualPin edc:name="RF0"/>
      <edc:VirtualPin edc:name="RPF0" edc:ppsgroup="2" edc:ppsval="4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 59-->
      <edc:VirtualPin edc:name="RF1"/>
      <edc:VirtualPin edc:name="RPF1" edc:ppsgroup="1" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="TRCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 60-->
      <edc:VirtualPin edc:name="RE0"/>
      <edc:VirtualPin edc:name="PMD0"/>
      <edc:VirtualPin edc:name="TRD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 61-->
      <edc:VirtualPin edc:name="RE1"/>
      <edc:VirtualPin edc:name="PMD1"/>
      <edc:VirtualPin edc:name="TRD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 62-->
      <edc:VirtualPin edc:name="RE2"/>
      <edc:VirtualPin edc:name="PMD2"/>
      <edc:VirtualPin edc:name="AN20"/>
      <edc:VirtualPin edc:name="TRD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 63-->
      <edc:VirtualPin edc:name="RE3"/>
      <edc:VirtualPin edc:name="PMD3"/>
      <edc:VirtualPin edc:name="CTPLS"/>
      <edc:VirtualPin edc:name="RPE3" edc:ppsgroup="3" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="TRD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 64-->
      <edc:VirtualPin edc:name="RE4"/>
      <edc:VirtualPin edc:name="PMD4"/>
      <edc:VirtualPin edc:name="AN21"/>
    </edc:Pin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT3" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T2CK" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC3" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U1RX" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U2RX" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U5CTS" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="REFCLKI" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT4" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T5CK" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC4" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U3RX" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U4CTS" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI1" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI2" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT2" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T4CK" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC2" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC5" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U1CTS" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U2CTS" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS1" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT1" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T3CK" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC1" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U3CTS" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U4RX" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U5RX" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS2" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="OCFA" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U3TX" edc:ppsgroup="1" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U4RTS" edc:ppsgroup="1" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO2" edc:ppsgroup="1" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC3" edc:ppsgroup="1" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C2OUT" edc:ppsgroup="1" edc:ppsval="13"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2TX" edc:ppsgroup="2" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1TX" edc:ppsgroup="2" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U5RTS" edc:ppsgroup="2" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO2" edc:ppsgroup="2" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO1" edc:ppsgroup="2" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC4" edc:ppsgroup="2" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U3RTS" edc:ppsgroup="3" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U4TX" edc:ppsgroup="3" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="REFCLKO" edc:ppsgroup="3" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U5TX" edc:ppsgroup="3" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS1" edc:ppsgroup="3" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO1" edc:ppsgroup="3" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC5" edc:ppsgroup="3" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C1OUT" edc:ppsgroup="3" edc:ppsval="13"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2RTS" edc:ppsgroup="4" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1RTS" edc:ppsgroup="4" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U5TX" edc:ppsgroup="4" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS2" edc:ppsgroup="4" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO1" edc:ppsgroup="4" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC2" edc:ppsgroup="4" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC1" edc:ppsgroup="4" edc:ppsval="12"/>
    </edc:RemappablePin>
  </edc:PinList>
</edc:PIC>
